AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/main.cpp
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_heap_caps.h"
#include "esp_netif.h"
#include "esp_event.h"
#include "driver/gpio.h"
#include "driver/uart.h"
#include "bsp/esp32_p4_wifi6_touch_lcd_4b.h"
#include "lvgl.h"
#include "draw/lv_image_decoder_private.h"
#include "draw/lv_draw_buf_private.h"
#include "btn_mode.h"
#include "ui_user.h"
#include "ui_dev.h"
#include "ui_exec.h"
#include "ui_pm.h"
#include "calib.h"
#include "eth_upload.h"
#include "wifi_mqtt.h"

static const char *TAG = "LIV24";

#define BOOT_BTN    GPIO_NUM_35
#define RELAY1_GPIO GPIO_NUM_32
#define RELAY2_GPIO GPIO_NUM_46
#define NUM_PAGES   3


// ── RS485 / MODBUS ─────────────────────────────────────
#define RS485_TXD      GPIO_NUM_47
#define RS485_RXD      GPIO_NUM_48
#define RS485_UART     UART_NUM_1
#define MODBUS_BAUD    9600
#define MODBUS_SLAVE   0x01
#define MODBUS_TIMEOUT pdMS_TO_TICKS(300)

static const gpio_num_t RELAY_GPIO[2] = {RELAY1_GPIO, RELAY2_GPIO};

static lv_obj_t *scr[NUM_PAGES];
static lv_obj_t *scr_eth_setup = NULL;
static int cur_page = 0;

// Page 2: sensor value labels (updated by sensor task later)
lv_obj_t *lbl_temp_val;
lv_obj_t *lbl_hum_val;
lv_obj_t *lbl_sound_val;
lv_obj_t *lbl_pm25_val;
lv_obj_t *lbl_pm10_val;

// Page 3: relay state
static bool relay_on[2] = {false, false};
static lv_obj_t *relay_btn[2];
static lv_obj_t *relay_btn_lbl[2];

// ─── helpers ───────────────────────────────────────────

static lv_obj_t *make_hline(lv_obj_t *parent, int y, int w = 560)
{
    lv_obj_t *line = lv_obj_create(parent);
    lv_obj_set_size(line, w, 2);
    lv_obj_set_style_bg_color(line, lv_color_hex(0x00E5FF), 0);
    lv_obj_set_style_border_width(line, 0, 0);
    lv_obj_set_style_pad_all(line, 0, 0);
    lv_obj_align(line, LV_ALIGN_TOP_MID, 0, y);
    return line;
}

static lv_obj_t *make_label(lv_obj_t *parent, const char *text,
                             uint32_t color, const lv_font_t *font,
                             lv_align_t align, int x, int y)
{
    lv_obj_t *lbl = lv_label_create(parent);
    lv_label_set_text(lbl, text);
    lv_obj_set_style_text_color(lbl, lv_color_hex(color), 0);
    lv_obj_set_style_text_font(lbl, font, 0);
    lv_obj_align(lbl, align, x, y);
    return lbl;
}

// ─── Page 1: Splash ────────────────────────────────────
// Shows logo image (centered) if logo.png is on SPIFFS; otherwise falls back to text.

static void create_splash(void)
{
    scr[0] = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr[0], lv_color_hex(0x080808), 0);
    lv_obj_set_style_bg_opa(scr[0], LV_OPA_COVER, 0);
    lv_obj_set_style_pad_all(scr[0], 0, 0);

    if (eth_upload_has_logo()) {
        lv_obj_t *logo = lv_image_create(scr[0]);
        lv_image_set_src(logo, ETH_LOGO_LVGL_PATH);
        lv_obj_set_size(logo, 240, 240);
        lv_image_set_inner_align(logo, LV_IMAGE_ALIGN_STRETCH);
        lv_obj_align(logo, LV_ALIGN_CENTER, 0, -60);
        // Transparent PNGs would be invisible on the dark splash background.
        // Setting bg_color+bg_opa makes the widget fill with white first, so
        // transparent pixels in the PNG composite against white instead of black.
        lv_obj_set_style_bg_color(logo, lv_color_white(), 0);
        lv_obj_set_style_bg_opa(logo, LV_OPA_COVER, 0);

        make_label(scr[0], "LIV-24",   0x00E5FF, &lv_font_montserrat_32,
                   LV_ALIGN_CENTER, 0,  80);
        make_label(scr[0], "IoT NODE", 0x334455, &lv_font_montserrat_14,
                   LV_ALIGN_CENTER, 0, 120);
    } else {
        make_label(scr[0], "LIV-24",   0x00ff44, &lv_font_montserrat_48,
                   LV_ALIGN_CENTER, 0, -120);
        make_label(scr[0], "IoT NODE", 0xffffff, &lv_font_montserrat_32,
                   LV_ALIGN_CENTER, 0,  -40);
        make_hline(scr[0], 340);
        make_label(scr[0], "Waveshare ESP32-P4",   0x555555, &lv_font_montserrat_14,
                   LV_ALIGN_CENTER, 0,  70);
        make_label(scr[0], "Device ID: ESP32-001", 0x777777, &lv_font_montserrat_14,
                   LV_ALIGN_CENTER, 0, 100);
        make_label(scr[0], "[ BOOT ]  next page  >", 0x335533, &lv_font_montserrat_14,
                   LV_ALIGN_BOTTOM_MID, 0, -30);
    }
}

// ─── Ethernet Setup screen ─────────────────────────────
// Shown when no logo found — prompts user to plug in Ethernet and browse to device IP.

static lv_obj_t *create_eth_setup_screen(lv_obj_t **out_qr, lv_obj_t **out_ip_label)
{
    scr_eth_setup = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr_eth_setup, lv_color_hex(0x0A0A12), 0);
    lv_obj_set_style_bg_opa(scr_eth_setup, LV_OPA_COVER, 0);
    lv_obj_set_style_pad_all(scr_eth_setup, 0, 0);

    lv_obj_t *bar = lv_obj_create(scr_eth_setup);
    lv_obj_set_size(bar, 720, 6);
    lv_obj_align(bar, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_bg_color(bar, lv_color_hex(0x00E5FF), 0);
    lv_obj_set_style_border_width(bar, 0, 0);
    lv_obj_set_style_pad_all(bar, 0, 0);

    make_label(scr_eth_setup, "SETUP MODE",
               0x00E5FF, &lv_font_montserrat_32, LV_ALIGN_TOP_MID, 0, 26);
    make_label(scr_eth_setup, "1.  Plug in Ethernet cable",
               0x556677, &lv_font_montserrat_24, LV_ALIGN_TOP_MID, 0, 90);
    make_label(scr_eth_setup, "2.  Scan QR to upload logo",
               0x445566, &lv_font_montserrat_24, LV_ALIGN_TOP_MID, 0, 135);

    // QR code — hidden until DHCP assigns IP, then updated with the URL
    lv_obj_t *qr = lv_qrcode_create(scr_eth_setup);
    lv_qrcode_set_size(qr, 260);
    lv_qrcode_set_dark_color(qr, lv_color_hex(0x00E5FF));
    lv_qrcode_set_light_color(qr, lv_color_hex(0x0A0A12));
    lv_obj_align(qr, LV_ALIGN_CENTER, 0, 20);
    lv_obj_add_flag(qr, LV_OBJ_FLAG_HIDDEN);
    *out_qr = qr;

    // IP URL label — shown below QR, updated alongside the QR
    lv_obj_t *ip_lbl = lv_label_create(scr_eth_setup);
    lv_label_set_text(ip_lbl, "Waiting for IP...");
    lv_obj_set_style_text_color(ip_lbl, lv_color_hex(0xFFAA00), 0);
    lv_obj_set_style_text_font(ip_lbl, &lv_font_montserrat_24, 0);
    lv_obj_align(ip_lbl, LV_ALIGN_BOTTOM_MID, 0, -60);
    *out_ip_label = ip_lbl;

    make_label(scr_eth_setup, "Upload PNG — device restarts automatically",
               0x334455, &lv_font_montserrat_14, LV_ALIGN_BOTTOM_MID, 0, -20);

    return scr_eth_setup;
}

