AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/main.cpp
// ─── Page 2: Sensor Dashboard ─────────────────────────

static void add_sensor_row(lv_obj_t *parent, const char *name, const char *unit,
                            lv_obj_t **val_lbl, int y)
{
    make_label(parent, name, 0x888888, &lv_font_montserrat_14, LV_ALIGN_TOP_LEFT, 60, y);
    *val_lbl = make_label(parent, "--", 0x00ff88, &lv_font_montserrat_24,
                          LV_ALIGN_TOP_MID, 0, y - 6);
    make_label(parent, unit, 0x555555, &lv_font_montserrat_14, LV_ALIGN_TOP_RIGHT, -60, y);
}

static void create_sensors(void)
{
    scr[1] = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr[1], lv_color_hex(0x080808), 0);
    lv_obj_set_style_bg_opa(scr[1], LV_OPA_COVER, 0);

    make_label(scr[1], "SENSOR DATA", 0x00ff44, &lv_font_montserrat_24,
               LV_ALIGN_TOP_MID, 0, 30);
    make_hline(scr[1], 80);

    add_sensor_row(scr[1], "Temperature", "\xC2\xB0""C",  &lbl_temp_val,  120);
    add_sensor_row(scr[1], "Humidity",    "%",             &lbl_hum_val,   210);
    add_sensor_row(scr[1], "Sound",       "dB",            &lbl_sound_val, 300);
    add_sensor_row(scr[1], "PM2.5",       "ug/m3",         &lbl_pm25_val,  390);
    add_sensor_row(scr[1], "PM10",        "ug/m3",         &lbl_pm10_val,  480);

    make_hline(scr[1], 580);
    make_label(scr[1], "[ BOOT ]  next page  >", 0x00E5FF, &lv_font_montserrat_14,
               LV_ALIGN_BOTTOM_MID, 0, -30);
}

// ─── Page 3: Relay Control ─────────────────────────────
// Styled header bar (72px) matching USER/PM screens.
// Relay buttons shifted +72px down from previous layout.

// Called from both button tap and MQTT — safe from any task via bsp_display_lock.
void relay_set_state(int idx, bool on)
{
    if (idx < 0 || idx > 1) return;
    relay_on[idx] = on;
    gpio_set_level(RELAY_GPIO[idx], on ? 1 : 0);
    ESP_LOGI(TAG, "Relay %d -> %s (GPIO%d=%d)",
             idx + 1, on ? "ON" : "OFF", RELAY_GPIO[idx], on ? 1 : 0);

    if (bsp_display_lock(50)) {
        lv_label_set_text(relay_btn_lbl[idx], on ? "ON" : "OFF");
        lv_obj_set_style_bg_color(relay_btn[idx],
            on ? lv_color_hex(0x00E5FF) : lv_color_hex(0x222222), 0);
        lv_obj_set_style_text_color(relay_btn_lbl[idx],
            on ? lv_color_hex(0xFFFFFF) : lv_color_hex(0x555555), 0);
        bsp_display_unlock();
    }
}

static void relay_cb(lv_event_t *e)
{
    int idx = (int)(intptr_t)lv_event_get_user_data(e);
    relay_set_state(idx, !relay_on[idx]);
}

static void create_relay_ctrl(void)
{
    scr[2] = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr[2], lv_color_hex(0x0A0A12), 0);
    lv_obj_set_style_bg_opa(scr[2], LV_OPA_COVER, 0);
    lv_obj_set_style_pad_all(scr[2], 0, 0);

    // ── Header bar (72px) — same style as USER/PM screens ──
    lv_obj_t *hdr = lv_obj_create(scr[2]);
    lv_obj_set_size(hdr, 720, 72);
    lv_obj_align(hdr, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_bg_color(hdr, lv_color_hex(0x12121E), 0);
    lv_obj_set_style_bg_opa(hdr, LV_OPA_COVER, 0);
    lv_obj_set_style_radius(hdr, 0, 0);
    lv_obj_set_style_border_width(hdr, 0, 0);
    lv_obj_set_style_pad_hor(hdr, 22, 0);
    lv_obj_clear_flag(hdr, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *accent = lv_obj_create(hdr);
    lv_obj_set_size(accent, 720, 3);
    lv_obj_align(accent, LV_ALIGN_TOP_MID, 0, 48);
    lv_obj_set_style_bg_color(accent, lv_color_hex(0x00E5FF), 0);
    lv_obj_set_style_border_width(accent, 0, 0);
    lv_obj_set_style_pad_all(accent, 0, 0);

    // Logo (left side, if available) — user-uploaded PNG
    int title_x = 0;
    if (eth_upload_has_logo()) {
        lv_obj_t *logo_img = lv_image_create(hdr);
        lv_image_set_src(logo_img, ETH_LOGO_LVGL_PATH);
        lv_obj_set_size(logo_img, 48, 48);
        lv_image_set_inner_align(logo_img, LV_IMAGE_ALIGN_STRETCH);
        lv_obj_align(logo_img, LV_ALIGN_LEFT_MID, 0, 0);
        title_x = 58;
    }

    lv_obj_t *lbl_title = lv_label_create(hdr);
    lv_label_set_text(lbl_title, "RELAY CONTROL");
    lv_obj_set_style_text_color(lbl_title, lv_color_hex(0x00E5FF), 0);
    lv_obj_set_style_text_font(lbl_title, &lv_font_montserrat_32, 0);
    lv_obj_align(lbl_title, LV_ALIGN_LEFT_MID, title_x, 0);

    lv_obj_t *lbl_nav = lv_label_create(hdr);
    lv_label_set_text(lbl_nav, "< PM");
    lv_obj_set_style_text_color(lbl_nav, lv_color_hex(0x3A4A5A), 0);
    lv_obj_set_style_text_font(lbl_nav, &lv_font_montserrat_14, 0);
    lv_obj_align(lbl_nav, LV_ALIGN_RIGHT_MID, 0, 0);

    // ── Relay buttons — shifted +72px for header ──────────
    // Button 1: y=252 (was 180), Button 2: y=492 (was 420)
    // Button 2 bottom: 492+140=632, margin to screen bottom: 88px ✓
    const char *names[] = {"RELAY  1", "RELAY  2"};
    const int   ys[]    = {252, 492};

    for (int i = 0; i < 2; i++) {
        make_label(scr[2], names[i], 0x888888, &lv_font_montserrat_14,
                   LV_ALIGN_TOP_MID, 0, ys[i] - 50);

        relay_btn[i] = lv_btn_create(scr[2]);
        lv_obj_set_size(relay_btn[i], 400, 140);
        lv_obj_set_style_bg_color(relay_btn[i], lv_color_hex(0x222222), 0);
        lv_obj_set_style_radius(relay_btn[i], 12, 0);
        lv_obj_set_style_border_color(relay_btn[i], lv_color_hex(0x333333), 0);
        lv_obj_set_style_border_width(relay_btn[i], 2, 0);
        lv_obj_align(relay_btn[i], LV_ALIGN_TOP_MID, 0, ys[i]);
        lv_obj_add_event_cb(relay_btn[i], relay_cb, LV_EVENT_CLICKED,
                            (void *)(intptr_t)i);

        relay_btn_lbl[i] = lv_label_create(relay_btn[i]);
        lv_label_set_text(relay_btn_lbl[i], "OFF");
        lv_obj_set_style_text_font(relay_btn_lbl[i], &lv_font_montserrat_32, 0);
        lv_obj_set_style_text_color(relay_btn_lbl[i], lv_color_hex(0x555555), 0);
        lv_obj_center(relay_btn_lbl[i]);
    }

    make_label(scr[2], "Hold 7s = Dev", 0x223344, &lv_font_montserrat_14,
               LV_ALIGN_BOTTOM_MID, 0, -16);
}

// ─── RS485 / MODBUS RTU ────────────────────────────────

static uint16_t crc16(const uint8_t *buf, int len)
{
    uint16_t crc = 0xFFFF;
    for (int i = 0; i < len; i++) {
        crc ^= buf[i];
        for (int j = 0; j < 8; j++)
            crc = (crc & 1) ? (crc >> 1) ^ 0xA001 : (crc >> 1);
    }
    return crc;
}

static void rs485_init(void)
{
    uart_config_t cfg = {
        .baud_rate  = MODBUS_BAUD,
        .data_bits  = UART_DATA_8_BITS,
        .parity     = UART_PARITY_DISABLE,
        .stop_bits  = UART_STOP_BITS_1,
        .flow_ctrl  = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };
    uart_driver_install(RS485_UART, 256, 0, 0, NULL, 0);
    uart_param_config(RS485_UART, &cfg);
    uart_set_pin(RS485_UART, RS485_TXD, RS485_RXD,
                 UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    uart_set_mode(RS485_UART, UART_MODE_RS485_HALF_DUPLEX);
}

