AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/main.cpp
// REG MAP (SN-300BYH-M, all /10 except sound):
// 0x0000=Humidity*0.1%  0x0001=Temp*0.1C
// 0x0003=PM10*0.1ug/m3  0x0004=PM2.5*0.1ug/m3  0x0005=Sound dB
static bool modbus_read(uint16_t start_reg, uint8_t count, uint16_t *out)
{
    if (count == 0 || count > 30) return false;

    uint8_t req[8];
    req[0] = MODBUS_SLAVE;
    req[1] = 0x03;
    req[2] = start_reg >> 8;
    req[3] = start_reg & 0xFF;
    req[4] = 0x00;
    req[5] = count;
    uint16_t crc = crc16(req, 6);
    req[6] = crc & 0xFF;
    req[7] = crc >> 8;

    uart_flush_input(RS485_UART);
    uart_write_bytes(RS485_UART, req, sizeof(req));

    int expected = 5 + 2 * count;
    uint8_t resp[64] = {};
    int got = uart_read_bytes(RS485_UART, resp, expected, MODBUS_TIMEOUT);
    if (got < expected) return false;

    uint16_t resp_crc = resp[got - 2] | (resp[got - 1] << 8);
    if (crc16(resp, got - 2) != resp_crc) return false;

    for (int i = 0; i < count; i++)
        out[i] = (resp[3 + i * 2] << 8) | resp[4 + i * 2];
    return true;
}

static void sensor_read_task(void *arg)
{
    uint16_t regs[6];
    char buf[16];

    while (1) {
        if (modbus_read(0x0000, 6, regs)) {
            float hum   = regs[0] / 10.0f;
            float temp  = regs[1] / 10.0f;
            float pm10  = regs[3] / 10.0f;
            float pm25  = regs[4] / 10.0f;
            uint16_t snd = regs[5];

            ESP_LOGI(TAG, "T=%.1fC H=%.1f%% Sound=%ddB PM2.5=%.1f PM10=%.1f",
                     temp, hum, snd, pm25, pm10);

            float t_cal   = calib_apply(temp,        &g_calib.temp);
            float h_cal   = calib_apply(hum,         &g_calib.hum);
            float p25_cal = calib_apply(pm25,        &g_calib.pm25);
            float p10_cal = calib_apply(pm10,        &g_calib.pm10);
            float s_cal   = calib_apply((float)snd,  &g_calib.sound);

            bsp_display_lock(0);
            ui_user_update(t_cal, h_cal, p25_cal, p10_cal, (int)s_cal);
            ui_pm_update(p25_cal, p10_cal);
            ui_dev_update(temp, hum, (float)snd, pm25, pm10);
            ui_exec_update(p25_cal, p10_cal, (int)s_cal);
            bsp_display_unlock();

            wifi_mqtt_publish_sensors(t_cal, h_cal, (int)s_cal, p25_cal, p10_cal);
        } else {
            ESP_LOGW(TAG, "sensor: no response");
        }
        vTaskDelay(pdMS_TO_TICKS(2000));
    }
}

// ─── Touch navigation: replaces BOOT button (GPIO35 = EMAC TXD1 conflict) ────

static void touch_nav_init(void)
{
    // ── ▶ next-page button at bottom-right of USER-mode screens ──────────────
    // PM screen: strip card is 175px tall anchored 48px above bottom → top at H−223.
    // Use y_ofs=−231 so button clears the strip with 8px gap; USER/RELAY use −8.
    lv_obj_t *cycle_scrns[] = {scr_user, scr_pm, scr[2]};
    int       cycle_y[]     = {-8,       -231,   -8};
    for (int i = 0; i < 3; i++) {
        lv_obj_t *btn = lv_btn_create(cycle_scrns[i]);
        lv_obj_set_size(btn, 88, 56);
        lv_obj_align(btn, LV_ALIGN_BOTTOM_RIGHT, -8, cycle_y[i]);
        lv_obj_set_style_bg_color(btn, lv_color_hex(0x00E5FF), 0);
        lv_obj_set_style_bg_opa(btn, LV_OPA_10, 0);
        lv_obj_set_style_border_color(btn, lv_color_hex(0x00E5FF), 0);
        lv_obj_set_style_border_width(btn, 1, 0);
        lv_obj_set_style_border_opa(btn, LV_OPA_30, 0);
        lv_obj_set_style_radius(btn, 6, 0);
        lv_obj_set_style_shadow_width(btn, 0, 0);
        lv_obj_add_event_cb(btn, [](lv_event_t *) { on_short_press(); },
                            LV_EVENT_CLICKED, NULL);
        lv_obj_t *lbl = lv_label_create(btn);
        lv_label_set_text(lbl, LV_SYMBOL_RIGHT);
        lv_obj_set_style_text_color(lbl, lv_color_hex(0x00E5FF), 0);
        lv_obj_set_style_text_font(lbl, &lv_font_montserrat_24, 0);
        lv_obj_center(lbl);
    }

    // ── DEV / EXEC mode buttons — dark/hidden, bottom-left of USER screen ────
    {
        lv_obj_t *btn = lv_btn_create(scr_user);
        lv_obj_set_size(btn, 76, 40);
        lv_obj_align(btn, LV_ALIGN_BOTTOM_LEFT, 8, -8);
        lv_obj_set_style_bg_color(btn, lv_color_hex(0x0D0D1A), 0);
        lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(btn, 0, 0);
        lv_obj_set_style_radius(btn, 4, 0);
        lv_obj_set_style_shadow_width(btn, 0, 0);
        lv_obj_add_event_cb(btn, [](lv_event_t *) { set_app_mode(MODE_DEV); },
                            LV_EVENT_CLICKED, NULL);
        lv_obj_t *lbl = lv_label_create(btn);
        lv_label_set_text(lbl, "DEV");
        lv_obj_set_style_text_color(lbl, lv_color_hex(0x1C2535), 0);
        lv_obj_set_style_text_font(lbl, &lv_font_montserrat_14, 0);
        lv_obj_center(lbl);
    }
    {
        lv_obj_t *btn = lv_btn_create(scr_user);
        lv_obj_set_size(btn, 76, 40);
        lv_obj_align(btn, LV_ALIGN_BOTTOM_LEFT, 92, -8);
        lv_obj_set_style_bg_color(btn, lv_color_hex(0x0D0D1A), 0);
        lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(btn, 0, 0);
        lv_obj_set_style_radius(btn, 4, 0);
        lv_obj_set_style_shadow_width(btn, 0, 0);
        lv_obj_add_event_cb(btn, [](lv_event_t *) { set_app_mode(MODE_EXEC); },
                            LV_EVENT_CLICKED, NULL);
        lv_obj_t *lbl = lv_label_create(btn);
        lv_label_set_text(lbl, "EXEC");
        lv_obj_set_style_text_color(lbl, lv_color_hex(0x1C2535), 0);
        lv_obj_set_style_text_font(lbl, &lv_font_montserrat_14, 0);
        lv_obj_center(lbl);
    }

    // ── ← USER exit button on DEV and EXEC screens ───────────────────────────
    lv_obj_t *mode_scrns[] = {scr_dev, scr_exec};
    for (int i = 0; i < 2; i++) {
        lv_obj_t *btn = lv_btn_create(mode_scrns[i]);
        lv_obj_set_size(btn, 88, 40);
        lv_obj_align(btn, LV_ALIGN_TOP_RIGHT, -8, 72);  // 72 = 8px below DEV(64px) / EXEC(63px) headers
        lv_obj_set_style_bg_color(btn, lv_color_hex(0x1A1A2E), 0);
        lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, 0);
        lv_obj_set_style_border_color(btn, lv_color_hex(0x2C3D52), 0);
        lv_obj_set_style_border_width(btn, 1, 0);
        lv_obj_set_style_radius(btn, 6, 0);
        lv_obj_set_style_shadow_width(btn, 0, 0);
        lv_obj_add_event_cb(btn, [](lv_event_t *) { set_app_mode(MODE_USER); },
                            LV_EVENT_CLICKED, NULL);
        lv_obj_t *lbl = lv_label_create(btn);
        lv_label_set_text(lbl, LV_SYMBOL_LEFT " USER");
        lv_obj_set_style_text_color(lbl, lv_color_hex(0x445566), 0);
        lv_obj_set_style_text_font(lbl, &lv_font_montserrat_14, 0);
        lv_obj_center(lbl);
    }
}

// ─── btn_mode callbacks ────────────────────────────────

// Short press: USER -> PM -> RELAY -> USER  |  EXEC has no sub-pages
void on_short_press(void)
{
    bsp_display_lock(0);
    lv_obj_t *active = lv_scr_act();
    if (active == scr_exec) {
        // EXEC mode — short press does nothing
    } else if (active == scr_user) {
        lv_scr_load_anim(scr_pm, LV_SCR_LOAD_ANIM_MOVE_LEFT, 300, 0, false);
        ESP_LOGI(TAG, "-> PM History");
    } else if (active == scr_pm) {
        lv_scr_load_anim(scr[2], LV_SCR_LOAD_ANIM_MOVE_LEFT, 300, 0, false);
        ESP_LOGI(TAG, "-> Relay page");
    } else {
        lv_scr_load_anim(scr_user, LV_SCR_LOAD_ANIM_MOVE_RIGHT, 300, 0, false);
        ESP_LOGI(TAG, "-> User screen");
    }
    bsp_display_unlock();
}

void on_mode_changed(app_mode_t new_mode)
{
    bsp_display_lock(0);
    switch (new_mode) {
        case MODE_USER:
            lv_scr_load_anim(scr_user, LV_SCR_LOAD_ANIM_FADE_IN, 400, 0, false);
            break;
        case MODE_DEV:
            lv_scr_load_anim(scr_dev,  LV_SCR_LOAD_ANIM_MOVE_LEFT, 400, 0, false);
            break;
        case MODE_EXEC:
            lv_scr_load_anim(scr_exec, LV_SCR_LOAD_ANIM_NONE, 0, 0, false);
            break;
    }
    bsp_display_unlock();
}

// ─── app_main ──────────────────────────────────────────

