AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/main.cpp
extern "C" void app_main(void)
{
    ESP_LOGI(TAG, "LIV-24 starting...");

    // Init network stack once, at the very top — both eth_start_background()
    // and eth_upload_start() rely on these being called exactly once before use.
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    calib_init();
    rs485_init();

    // Relay GPIO init — default OFF
    gpio_config_t relay_cfg = {};
    relay_cfg.pin_bit_mask = (1ULL << RELAY1_GPIO) | (1ULL << RELAY2_GPIO);
    relay_cfg.mode         = GPIO_MODE_OUTPUT;
    relay_cfg.pull_down_en = GPIO_PULLDOWN_DISABLE;
    relay_cfg.pull_up_en   = GPIO_PULLUP_DISABLE;
    relay_cfg.intr_type    = GPIO_INTR_DISABLE;
    gpio_config(&relay_cfg);
    gpio_set_level(RELAY1_GPIO, 0);
    gpio_set_level(RELAY2_GPIO, 0);

    // ── Boot-hold reset: hold BOOT button at power-on → clears logo → setup mode ──
    gpio_set_direction(BOOT_BTN, GPIO_MODE_INPUT);
    gpio_set_pull_mode(BOOT_BTN, GPIO_PULLUP_ONLY);
    vTaskDelay(pdMS_TO_TICKS(150));
    if (gpio_get_level(BOOT_BTN) == 0) {
        eth_upload_clear_logo();
        ESP_LOGW(TAG, "Boot-hold: restarting into setup mode");
        esp_restart();
    }

    {
        bsp_display_cfg_t disp_cfg = {
            .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
            .buffer_size   = BSP_LCD_DRAW_BUFF_SIZE,
            .double_buffer = BSP_LCD_DRAW_BUFF_DOUBLE,
            .flags = {
                .buff_dma    = true,
                .buff_spiram = false,
                .sw_rotate   = true,
            },
        };
        disp_cfg.lvgl_port_cfg.task_stack = 16384;
        bsp_display_start_with_config(&disp_cfg);
    }
    bsp_display_backlight_on();

    // Initialize LVGL POSIX filesystem driver (maps drive 'A' → /spiffs)
    // Must be called after bsp_display_start() initializes LVGL.
    lv_fs_posix_init();
    lv_lodepng_init();
    lv_tjpgd_init();

    // Route PNG pixel-data allocations to PSRAM.
    // Without this, lv_draw_buf_create_ex pulls from the 128KB LVGL internal heap
    // which can't hold a 65KB file buffer + 160KB pixel buffer simultaneously.
    // With PSRAM: file buffer stays on LVGL heap (≤65KB), pixel buffer goes to 32MB SPIRAM.
    {
        lv_draw_buf_handlers_t *h = lv_draw_buf_get_image_handlers();
        h->buf_malloc_cb = [](size_t sz, lv_color_format_t) -> void * {
            return heap_caps_malloc(sz, MALLOC_CAP_SPIRAM);
        };
        h->buf_free_cb = [](void *p) { heap_caps_free(p); };
    }

    // Mount SPIFFS and check if logo.png exists
    eth_upload_init();

    // ── Logo diagnostic ───────────────────────────────────────────────────────
    if (eth_upload_has_logo()) {
        // Test 1: LVGL POSIX FS — open + read PNG magic bytes
        lv_fs_file_t fsf;
        lv_fs_res_t fsres = lv_fs_open(&fsf, ETH_LOGO_LVGL_PATH, LV_FS_MODE_RD);
        if (fsres == LV_FS_RES_OK) {
            uint8_t fhdr[8] = {};
            uint32_t br = 0;
            lv_fs_read(&fsf, fhdr, 8, &br);
            lv_fs_close(&fsf);
            bool is_png = (br >= 4 && fhdr[0] == 0x89 && fhdr[1] == 0x50 &&
                           fhdr[2] == 0x4E && fhdr[3] == 0x47);
            ESP_LOGI(TAG, "DIAG FS  : OK  %02X%02X%02X%02X  PNG=%s",
                     fhdr[0], fhdr[1], fhdr[2], fhdr[3], is_png ? "YES" : "NO");
        } else {
            ESP_LOGE(TAG, "DIAG FS  : FAIL res=%d", fsres);
        }

        // Test 2: image decoder header — needs display lock
        bsp_display_lock(0);
        lv_image_header_t img_hdr = {};
        lv_result_t dec_res = lv_image_decoder_get_info(ETH_LOGO_LVGL_PATH, &img_hdr);
        if (dec_res == LV_RESULT_OK) {
            ESP_LOGI(TAG, "DIAG DEC : OK  %dx%d  cf=%d",
                     img_hdr.w, img_hdr.h, (int)img_hdr.cf);
        } else {
            ESP_LOGE(TAG, "DIAG DEC : FAIL  (decoder not registered / file corrupt)");
        }

        // Test 3: full pixel decode — DIAG DEC only reads the PNG IHDR (header bytes),
        // not pixels. If lodepng errors during full decode the widget silently shows nothing.
        lv_image_decoder_dsc_t dec_dsc = {};
        lv_result_t open_res = lv_image_decoder_open(&dec_dsc, ETH_LOGO_LVGL_PATH, NULL);
        if (open_res == LV_RESULT_OK && dec_dsc.decoded && dec_dsc.decoded->data) {
            const uint8_t *p = dec_dsc.decoded->data;   // BGRA byte order in memory
            ESP_LOGI(TAG, "DIAG OPEN: OK  px0=A%02X R%02X G%02X B%02X",
                     p[3], p[2], p[1], p[0]);
            lv_image_decoder_close(&dec_dsc);
        } else {
            ESP_LOGE(TAG, "DIAG OPEN: FAIL  res=%d  decoded=%p",
                     (int)open_res, (void *)dec_dsc.decoded);
            if (open_res == LV_RESULT_OK) lv_image_decoder_close(&dec_dsc);
        }

        bsp_display_unlock();
    }

    // Sensor task created HERE — after bsp_display_start() — so bsp_display_lock()
    // is never called before lvgl_port_init (would assert-fail in esp_lvgl_port).
    xTaskCreate(sensor_read_task, "sensor", 4096, NULL, 5, NULL);

    if (!eth_upload_has_logo()) {
        // ── Ethernet Setup mode: no logo yet — show QR + IP and wait for upload ──
        lv_obj_t *qr_obj, *ip_label;
        bsp_display_lock(0);
        create_eth_setup_screen(&qr_obj, &ip_label);
        lv_scr_load(scr_eth_setup);
        bsp_display_unlock();

        // eth_upload_start() starts Ethernet+DHCP+HTTP, blocks until esp_restart()
        eth_upload_start(qr_obj, ip_label);
        return;
    }

    // ── Normal boot: logo exists ─────────────────────────────
    // One lock block: create ALL screens + load splash first.
    // taskLVGL blocked for entire duration → no dirty PSRAM L2 cache lines
    // at unlock → avoids ESP32-P4 Rev 1.3 ROM deadlock.
    bsp_display_lock(0);
    create_splash();          // shows logo centered on dark bg
    create_sensors();
    create_relay_ctrl();
    ui_user_create();
    ui_pm_create();
    ui_dev_create();
    ui_exec_create();
    touch_nav_init();
    lv_scr_load(scr[0]);     // show logo splash — inside the same lock block
    bsp_display_unlock();

    // Hold logo splash for 2.5s, then fade into USER screen
    vTaskDelay(pdMS_TO_TICKS(2500));

    bsp_display_lock(0);
    lv_scr_load_anim(scr_user, LV_SCR_LOAD_ANIM_FADE_IN, 600, 0, false);
    bsp_display_unlock();

    // Register MQTT handler BEFORE starting Ethernet — esp_eth_start() blocks
    // during PHY autonegotiation; DHCP can complete during that block so the
    // IP_EVENT_ETH_GOT_IP handler must already be registered when it fires.
    wifi_mqtt_set_relay_cb(relay_set_state);
    wifi_mqtt_init(MQTT_BROKER_URI);
    eth_start_background();

    // btn_mode_init(BOOT_BTN);
    // GPIO35 = EMAC RMII TXD1. gpio_config(INPUT) from btn_mode_init clears the
    // GPIO matrix output-enable on GPIO35, disabling TXD1 and corrupting all
    // Ethernet TX frames. Button disabled until a non-EMAC GPIO is identified.
}
